// HomeWork 4.3

/* Основне завдання, cтворити скрипт яки повинен виконувати наступне:
запитати у користувача рік народження;
запитати в нього, в якому місті він живе;
запитати його улюблений вид спорту.
При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:
його вік;
якщо користувач вкаже Київ, Вашингтон чи Лондон, то показати йому повідомлення - "Ти живеш у столиці..." і на місце точок підставляємо країну, столицею якої є місто. Інакше показуємо йому “ти живеш у місті…”, де місце точок – введене місто.
*/

    let yearOfBirth = prompt("Enter your year of birth")
    let cityLive = prompt("Enter the city where you live")
    let favSport = prompt("Enter your favourite sport")

    if (yearOfBirth === null || yearOfBirth.trim() === "") {
        alert("Шкода, що ви не захотіли ввести свій вік 😢")
    } else {
        let years = 2025 - parseInt(yearOfBirth);
        alert(`Вам : ${years} років`)
    }

    if ( cityLive === "Київ" ) {
        alert("Ви живете в столиці України!")
    } else if ( cityLive === "Вашингтон" ) {
        alert("Ви живете в столиці США!")
    } else if ( cityLive === "Лондон" ) {
        alert("Ви живете в столиці Великої Британії!")
    } else if ( cityLive === "Washington") {
        alert("You live in the capital of the United States!")
    } else if ( cityLive === "London" ) {
        alert("You live in the capital of Great Britain!")
    } else if (cityLive === null || cityLive.trim() === "") {
        alert("Шкода, що ви не захотіли ввести місто, в якому живете😒")
    } else {
        alert(`Ви живете у місті ${cityLive}`)
    }


/*
Додаткове завдання *
Вибираємо самі три види спорту та три чемпіони у цих видах. Відповідно, якщо користувач вкаже один із цих видів спорту, то показуємо йому повідомлення “Круто! Хочеш стати …? і підставляємо на місце точок ім'я та прізвище чемпіона.

Все це має бути відображено в одному вікні (алерті).
*/

    if (favSport === "Бокс") {
        alert("Круто! Хочеш стати Олександром Усиком?")
    } else if ( favSport === "Футбол") {
        alert("Круто! Хочеш стати Ліонелем Мессі?") 
    } else if ( favSport === "Теніс") {
        alert("Круто! Хочеш стати Новаком Джоковичем?") 
    }

/* 
Додаткове завдання
Якщо в якомусь випадку він не захоче вводити інформацію 
і натисне Скасувати, показати йому повідомлення
– “Шкода, що Ви не захотіли ввести свій(ю) …” і вказуємо, 
що він не захотів вводити – дату народження, місто чи вид спорту .
*/


// Я його інтегрував в перше завдання
    
    if (favSport === null || favSport.trim() === "") {
        alert("Шкода, що ви не захотіли ввести свій улюблений вид спорту 😑")
    }



/// Також зробив це завдання з використання if, switch, Якщо треба можу надіслати його(Там кож трохи коротше і все виводиться в одному алерті)