/// Home Work 1

///Створити масив, довжину та елементи якого задає користувач. 
//Після цього, відсортувати масив за зростанням. 
//Далі, видалити з масива елементи з 2-го по 4-й елемент. 
//По мірі змін масива - виводити його вміст на сторінку.

function first() {

/// 1 Створити масив, довжину та елементи якого задає користувач. 
let quantity = parseInt(prompt("Введіть кількість елементів масиву"));
let arr = [];

for(let i = 0; i < quantity; i++) {
    let elements = prompt("Введіть елементи масиву")
    arr.push(elements)
}

console.log(`Введений масив: ${arr}`)

/// 2 Після цього, відсортувати масив за зростанням

let sort = arr.sort((a, b) => a - b)
console.log(`Відсортований масив за зростанням: ${sort}`)

// Скорочений варіант 
// console.log(`Відсортований масив за зростанням: ${arr.sort((a, b) => a - b)}`)



/// 3 Далі, видалити з масива елементи з 2-го по 4-й елемент
// Трішки не зрозумів чи з 2-го по 4-й елемент включно чи ні, тому зроблю 2 варіанти

arr.splice(1, 2)
console.log(`Масив з видаленими лементами з 2-го по 4-й елемент: ${arr}`) 

// arr.splice(1, 3)
// console.log(`Масив з видаленими лементами з 2-го по 4-й елемент: ${arr}`) 

}
